<!-- BEGIN page_title_block -->
Σελίδα της PostgreSQL 8.1 για τον τύπο
<!-- END page_title_block -->

<h1>Σελίδα της PostgreSQL 8.1 για τον τύπο</h1>

<h2>Περιεχόμενα</h2>

<p>
 &nbsp; <a href="#original_release">Πρωτότυπη ανακοίνωση της νέας έκδοσης</a><br />
 &nbsp; <a href="#additional_features">Επιπρόσθετες Λειτουργίες</a><br />
 &nbsp; <a href="#quoted_companies">Πληροφορίες για τις αναφερθείσες εταιρείες</a><br />
 &nbsp; <a href="#download">Από που να την αποκτήσετε</a><br />
 &nbsp;	<a href="#docs">Τεκμηρίωση</a><br />
 &nbsp; <a href="#license">Άδεια χρήσης</a><br />
 &nbsp; <a href="#contact">Επικοινωνία</a><br />
 &nbsp; <a href="#companies">Χορηγίες από Επιχειρήσεις</a><br />
 &nbsp; <a href="#additional_software">Επιπρόσθετο Λογισμικό</a><br />
</p>

<a name="original_release"></a><h2>Πρωτότυπη ανακοίνωση της νέας έκδοσης</h2>
<p>
## 8 Νοεμβρίου 2005, Φρανκφούρτη, Γερμανία (OpenDBCon):  Το Παγκόσμιο Τμήμα Ανάπτυξης της PostgreSQL αμακοινώνει με υπερηφάνεια την κυκλοφορία της PostgreSQL έκδοσης 8.1, επεκτείνοντας περαιτέρω την ηγετική θέση της PostgreSQL ως το πιο εξελιγμένο σύστημα διαχείρισης βάσεων δεδομένων ανοιχτού κώδικα στον κόσμο. Σχεδιασμένη, υλοποιημένη και δοκιμασμένη από μία μεγάλη και αναπτυσσόμενη κοινότητα και υποστηριζόμενη από ένα αυξανόμενο αριθμό εταιρικών χορηγών και εταιρειών υποστήριξης, η έκδοση 8.1 θα επεκτείνει το εύρος της ανάπτυξης εφαρμογών βασισμένων στην PostgreSQL. Η νέα έκδοση συμπεριλαμβάνει βελτιστοποιήσεις στις επιδόσεις και εξελιγμένες λειτουργίες SQL οι οποίες θα υποστηρίξουν μεγαλύτερες αποθηκεύσεις δεδομένων, επεξεργασία συναλλαγών μεγαλύτερου όγκου, και πιο απαιτητικές επιχειρησιακές κατανεμημένες εφαρμογές.
</p><p>
Αυτές οι δυνατότητες θα ενδυναμώσουν την πορεία υϊοθέτησης του προϊόντος που ξεκίνησε από την προηγούμενη έκδοση. Η έκδοση 8.0 έχει μεταφορτωθεί ένα εκατομμύριο φορές τους πρώτους εφτά μήνες, σε σύγκριση με περίπου 300.000 φορές για την αντίστοιχη περίοδο της προηγούμενης έκδοσης.
</p><p>
"Το έργο επιταχύνει σαφώς τη διείσδυσή του στα μυαλά των χρηστών βάσεων δεδομένων," λέει ο Lance Obermeyer, Διευθυντής Προϊόντων της Pervasive Software, μίας από τις εταιρείες - χορηγούς της PostgreSQL. "Με δεδομένο το αυξανόμενο ενδιαφέρον σε λογισμικό υποδομής ανοιχτού κώδικα, περιμένουμε ότι η PostgreSQL θα δεχθεί περισσότερο ενδιαφέρον."
</p>
<h3>Νέες Εξελιγμένες Λειτουργίες Βάσεων Δεδομένων</h3>
<p>
<b>Ρόλοι:</b> Η PostgreSQL υποστηρίζει πλέον ρόλους στη βάση δεδομένων, οι οποίοι απλοποιούν τη διαχείριση μεγάλου αριθμού χρηστών με πολύπλοκα υπερκαλυπτόμενα δικαιώματα χρήσης.
</p><p>
<b>Παράμετροι IN/OUT:</b>  Οι συναρτήσεις της PostgreSQL τώρα υποστηρίζουν παραμέτρους IN, OUT και INOUT, βελτιώνοντας έτσι σημαντικά την υποστήριξη πολύπλοκης επιχειρησιακής λογικής για εφαρμογές J2EE και .NET.
</p><p>
<b>Καταχώριση Δύο Φάσεων</b> (2PC):  ζητούμενη από καιρό για εφαρμογές σε WAN και ετερογενή κέντρα δεδομένων που χρησιμοποιούν την PostgreSQL, αυτή η λειτουργία επιτρέπει συναλλαγές συμβατές με το πρότυπο ACID μεταξύ ξεχωριστών απόμακρων εξυπηρετητών.
</p>
<h3>Βελτιστοποιήσεις στις επιδόσεις</h3>
<p>
<b>Βελτιωμένες επιδόσεις Πολλαπλών Επεξεργαστών (SMP):</b> ο διαχειριστής ενδιάμεσης μνήμης για την 8.1 έχει εμπλουτιστεί για να επεκτείνεται σχεδόν αναλογικά με τον αριθμό των επεξεργαστών, προσδίδοντας έτσι σημαντικά κέρδη στις επιδόσεις σε εξυπηρετητές με 8, 16 επεξεργαστές, ή με επεξεργαστες δύο ή πολλαπλών πυρήνων.
</p><p>
<b>Δυαδική Σάρωση:</b>  τα ευρετήρια μετατρέπονται δυναμικά σε δυαδικά στη μνήμη όταν χρειάζεται, δίνοντας μέχρι και είκοσι φορές ταχύτερες επιδόσεις ευρετηρίων σε πολύπλοκα ερωτήματα σε πολύ μεγάλους πίνακες. Αυτό βοηθάει και στην απλοποίηση της διαχείρισης της βάσης δεδομένων, ελαττώνοντας την ανάγκη για ευρετήρια πολλαπλών στηλών.
</p><p>
<b>Κατατμήσεις Πινάκων:</b>  ο σχεδιαστής ερωτημάτων μπορεί τώρα να αποφύγει να σαρώσει ολόκληρα τμήματα από ένα μεγάλο πίνακα χρησιμοποιώντας μία τεχνική γνωστή ως Εξαίρεση Περιορισμών. Όμοια με τις Κατατμήσεις Πινάκων που συναντώνται σε άλλα συστήματα διαχείρισης βάσεων δεδομένων, αυτή η λειτουργία βελτιώνει τόσο τις επιδόσεις όσο και τη διαχείριση δεδομένων για πίνακες πολλών gigabytes.
</p><p>
<b>Διαμοιρασμένο Κλείδωμα Γραμμής:</b> Το "καλύτερο κλείδωμα από κλείδωμα γραμμής" της PostgreSQL τώρα υποστηρίζει ακόμα μεγαλύτερα επίπεδα ταυτόχρονης χρήσης με την προσθήκη διαμοιρασμένων κλειδώματων γραμμής για τα εξωτερικά κλειδιά. Τα διαμοιρασμένα κλειδώματα θα βελτιώσουν τις επιδόσεις των λειτουργιών insert και update σε πολλές εφαρμογές OLTP μεγάλων όγκων.
</p><p>
"Η PostgreSQL 8.1 προσφέρει μία τεράστια αύξηση στις επιδόσεις σε όλους τους τομείς, (στα δικούς μας) εξυπηρετητές με διπλούς επεξεργαστές Opteron που έχουμε σε παραγωγική λειτουργία," αναφάιρει ο Merlin Moncure, Διαχειριστής Βάσεων Δεδομένων για την εταιρεία Reliable Computer Solutions. "Πιο συγκεκριμένα, παρατηρώ περίπου 20% μείωση χρόνου εκτέλεσης σε απλά ερωτήματα, και επιπλέον 20% μείωση στο φόρτο του επεξεργαστή, για μία εντυπωσιακή βελτίωση της τάξης του 20 - 40% στα χαρακτηριστικά φόρτου των επεξεργαστών.
</p><p>
Υπάρχουν περισσότερες από 120 άλλες βελτιώσεις, μερικές από τις οποίες αναφέρονται λεπτομερώς στη σελίδα για τον τύπο της έκδοσης 8.1
</p>
<h3>Σχετικά με την PostgreSQL</h3>
<p>
Η PostgreSQL είναι η συλλογική εργασία εκατοντάδων προγραμματιστών, βασισμένη σε σχεδόν είκοσι χρόνια ανάπτυξης που ξεκίνησε στο Πανεπιστήμιο της Καλιφόρνια στο Μπέρκλεϋ. Με την μακροχρόνια υποστήριξή της λειτουργιών επαγγελματικού επιπέδου όπως οι συναλλαγές, οι αυτόματες διαδικασίες (triggers) και τα υπο-ερωτήματα, η PostgreSQL χρησιμοποιείται σήμερα σε πολλές από τις πιο απαιτητικές επιχειρήσεις και κυβερνητικούς οργανισμούς.  Η PostgreSQL διατίθεται υπό την άδεια χρήσης BSD, η οποία επιτρέπει τη χρήση και διανομή της χωρίς χρέωση, τόσο για εμπορικές όσο και για μη-εμπορικές εφαρμογές.
</p>

<a name="additional_features"></a><h2>Επιπρόσθετες λειτουργίες σε αυτή την έκδοση</h2>
Μαζί με τις κύριες λειτουργίες που αναφέρονται στο δελτίο τύπου, υπάρχουν πάνω από 120 νέες λειτουργίες και βελτιώσεις που έχουν συνεισφέρει περισσότεροι από 200 προγραμματιστές για την έκδοση 8.1. Μεταξύ αυτών είναι οι εξής:
<ul>
<li><b>GiST:</b> PostgreSQL's Generalised Search Tree (GiST) είναι ο μηχανισμός ευρετηρίασης που έχει βελτιωθεί για να υποστηρίξει ταυτόχρονη χρήση υψηλής ταχύτητας, δυνατότητα ανάκτησης και ταχύτητα στις ενημερώσεις που μέχρι τώρα βρίσκοντας μόνο στα ευρετήρια τύπου B-Tree. Το GiST είναι η ραχοκοκαλιά της ευρετηρίασης πλήρους κειμένου της PostgreSQL (TSearch2), της γεωστατιστικής (GIS) και της ευρετηρίασης δενδρικών δομών. Με αυτή τη βελτίωση, οι επιδόσεις για πολύπλοκους τύπους δεδομένων θα είναι υψηλές ακόμα και στις μεγαλύτερες εφαρμογές υψηλής διαθεσιμότητας.</li>
<li><b>Επανυλοποίηση της εντολής COPY:</b> Η εντολή COPY έχει υλοποιηθεί ξανά από την αρχή προσφέροντας έως και 30% ταχύτερη επεξεργασία των δεδομένων προς μαζική φόρτωση. Μαζί με βελτιώσεις στη φόρτωση μορφής CSV, αυτή η αλλαγή κάνει την φόρτωση μεγάλων βάσεων δεδομένων στην PostgreSQL πιο γρήγορη από ποτέ.</li>
<li><b>Δοιαμοιραζόμενη Μνήμη 64-bit:</b> ο διαχειριστής ενδιάμεσης μνήμης έχει βελτιωθεί για να χρησιμοποιεί έως και δύο terabytes μνήμης RAM σε πλατφόρμες των 64 bit, προετοιμάζοντας την PostgreSQL για τους επεξεργαστές με πολλή μνήμη στο μέλλον.</li>
<li><b>Ενσωματωμένη Αυτόματη Εκκαθάριση:</b> Η αυτόματη διεργασία συντήρησης βάσεων δεδομένων της PostgreSQL έχει βελτιωθεί και ενσωματωθεί πλέον στο κύριο πρόγραμμα του εξυπηρετητή, κάνοντας έτσι την εγκατάσταση και διαχείριση εξυπηρετητών PostgreSQL απλούστερες.</li>
<li><b>Ταχύτερες μαζικές λειτουργίες:</b> οι μαζικές λειτουργίες έχουν βελτιωθεί για να κάνουν τα αναφορικά ερωτήματα ακόμα ταχύτερα. Οι προγραμματιστές της PostgreSQL έχουν ξαναγράψει τη διαχείρισης μνήμης για μαζικές λειτουργίες, και έχουν προσθέσει βελτιστοποιήσεις στα ευρετήρια για τις λειτουργίες MIN() και MAX().</li>
<li><b>Διαχειριστικές Λειτουργίες:</b> νέες λειτουργίες έχουν προστεθεί για την ανάκτηση πληροφοριών για τον εξυπηρετητή και την εκτέλεση βασικών εργασιών διαχείρισης από το πρόγραμμα PSQL.</li>
<li><b>Λειτουργίες Συμβατότητας:</b> οι λειτουργίες lastval(), greatest() και least() έχουν προστεθεί, κάνοντας τη μεταφορά εφαρμογών από την MySQL και την Oracle ευκολότερη. </li>
</ul>
<p>
Μπορείτε να διαβάσετε σχετικά με τις δεκάδες βελτιώσεις στην έκδοση 8.1 στις <a href="/docs/current/static/release.html">Σημειώσεις Έκδοσης.</a>
</p>

<a name="quoted_companies"></a><h2>Πληροφορίες για τις αναφερθείσες εταιρείες</h2>

<p>
Η εταιρεία <b>Pervasive Software</b> (NASDQ: PVSW) παρέχει λογισμικό υποδομής δεδομένων που βοηθάνε εταιρείες να απελευθερώσουν την αξία των επενδύσεών τους σε δεδομένα. Για περισσότερες από δύο δεκαετίες, η Pervasive παρέχει μία πρωτοπόρα πρόταση αξίας και τον καλύτερο συνδυασμό απόδοσης, αξιοπιστίας, λειτουργικότητας και συνδεσιμότητας. Δεκάδες χιλιάδες πελάτες σε πρακτικά οποιοδήποτε τομέα, σε περισσότερες από 150 χώρες ανά τον κόσμο, στηρίζονται στην Pervasive για να διαχειριστούν, ενσωματώσουν, αναλύσουν και ασφαλίσουν τα κρίσιμα δεδομένα τους. Για περισσότερες πληροφορίες,  <a href="http://www.pervasive.com/company">δείτε την ιστοσελίδα μας</a>.
</p>
<p>
Η εταιρεία <b>Reliable Computer Solutions</b> παρέχει λογισμικό ERP και συμβουλευτικές υπηρεσίες για τοπικές κατασκευαστικές εταιρείες. Ειδικευόμαστε σε πλήρεις λύσεις Πληροφορικής για τους τομείς των Οχημάτων διασκέδασης και Κατασκευασμένων Οικιών. Η ναυαρχίδα των προϊόντων μας, το ESP, οδηγεί περισσότερα από ένα δισεκατομμύριο δολλάρια κατασκευών στις Ηνωμένες Πολιτείες. Για περισσότερες πληροφορίες, επικοινωνήστε με τον Merlin Moncure (Μόνο Αγγλικά): merlin.moncure@rcsonline.com, τηλέφωνο: (01) 269-483-1234 x304.
</p>

<a name="download"></a><h2>Από που να την αποκτήσετε</h2>

<ul>
<li><a href="http://www.postgresql.org/ftp/latest/">Λίστα Κατοπτρισμών FTP</a></li>
<li><a href="http://www.postgresql.org/download/bittorrent">Bittorrent</a></li>
<li><a href="http://www.postgresql.org/ftp/binary/v8.1.0/win32/">Εγκαταστάτης Windows</a> (επίσης διαθέσιμος μέσω του Bittorrent)</li>
<li><a href="http://www.postgresql.org/ftp/binary/v8.1.0/">Άλλα εκτελέσιμα,
συμπεριλαμβάνοντας εκδόσεις για  Linux, Mac OSX και Solaris</a></li>
<li><a href="http://sourceforge.net/projects/pgsql/">SourceForge</a> (συμπεριλαμβανομένου του εγκαταστάτη για Windows</li>
</ul>

<a name="docs"></a><h2>Τεκμηρίωση</h2>

<ul>
<li><a href="/docs/current/static/">Επίσημη Τεκμηρίωση</a></li>
<li><a href="http://techdocs.postgresql.org">TechDocs</a></li>
<li><a href="http://www.varlena.com/GeneralBits">General
Bits</a></li>
</ul>

<a name="license"></a><h2>Άδεια χρήσης</h2>
<p>
Η PostgreSQL χρησιμοποιεί την <a href="/about/licence">άδεια χρήσης BSD</a>, η οποία απαιτεί μόνο τη διατήρηση του copyright για τον πηγαίο κώδικα, και των πληροφοριών της άδειας χρήσης. Αυτή η άδεια χρήσης η οποία είναι <a href="http://www.opensource.org/licenses/bsd-license.php">πιστοποιημένη από τον OSI</a> είναι κοινώς αποδεκτή ως ευέλικτη και φιλική προς τις επιχειρήσεις, αφού δεν προσθέτει περιορισμούς για τη χρήση της PostgreSQL με εμπορικές εφαρμογές και εφαρμογές κλειστού κώδικα. Μαζί με την υποστήριξη από πολλές επιχειρήσεις, και την κοινή ιδιοκτησία του κώδικα, η άδεια BSD κάνει πολλές εταιρείες που θέλουν να ενσωματώσουν μία βάση δεδομένων στα δικά τους προϊόντα χωρίς να ανυσηχούν για το κόστος, τη σύνδεση με ένα μοναδικό πάροχο, ή πιθανές αλλαγές στην άδεια χρήσης, να προτιμάνε την PostgreSQL.
</p>

<a name="contact"></a><h2>Επικοινωνία</h2>

<p><a href="http://www.postgresql.org">English-language home page</a></p>

<p>Πληροφορίες:<br />
Μιχάλης Καμπριάνης<br />
Τοπικός εκπρόσωπος επικοινωνίας της PostgreSQL<br />
Κινητό: +306972211305<br />
<a href="mailto:el@postgresql.org">el@postgresql.org</a></p>

<p>Για επικοινωνία σε άλλες περιοχές, δείτε <a href="/about/press/contact">τη λίστα μας με τις διεθνείς επαφές.</a></p>

<a name="companies"></a><h2>Χορηγίες από Επιχειρήσεις</h2>

Η PostgreSQL απολαμβάνει την υποστήριξη πολλών επιχειρήσεων, που χρηματοδοτούν προγραμματιστές, παρέχουν πόρους φιλοξενίας και μας προσφέρουν οικονομική στήριξη. Οι μεγαλύτεροι μακροπρόθεσμοι χορηγοί αναφέρονται στη <a href="/about/sponsors">σελίδα μας με τους χορηγούς ανάπτυξης.</a>

Υπάρχει επίσης μία μεγάλη κοινότητα από <a
href="/support/professional_support">εταιρείες που προσφέρουν υποστήριξη για την PostgreSQL</a>, από απλούς συμβούλους μέχρι πολυεθνικές εταιρείες. 

<a name="additional_software"></a><h2>Επιπρόσθετο λογισμικό</h2>
<p>
Το κυρίως έργο της PostgreSQL εμπλουτίζεται με πάνω από 100 ενεργά υπο-έργα που παρέχουν ποιοτικές λύσεις για αναπαραγωγή, μετάβαση, συμβατότητα, διαλειτουργικότητα, γραφικά εργαλεία σχεδίασης και διαχείρισης. 
</p>

<h3>Σχετικά Έργα</h3>

<ul>
<li><a href="http://projects.postgresql.org">pgFoundry</a></li>
<li><a href="http://gborg.postgresql.org">GBorg</a></li>
</ul>

<h3>Οδηγοί</h3>

<ul>
<li><a href="http://jdbc.postgresql.org/">JDBC</a></li>
<li><a href="http://pgfoundry.org/projects/psqlodbc/">ODBC</a></li>
<li><a href="http://gborg.postgresql.org/project/npgsql/projdisplay.php">.Net</a></li>
<li><a href="http://search.cpan.org/~rudy/DBD-Pg-1.32/Pg.pm">Perl DBI</a></li>
<li><a href="http://initd.org/projects/psycopg1">Python</a></li>
</ul>

<h3>Πακέτα Εξελιγμένων Λειτουργιών</h3>

<ul>
<li><a href="http://postgis.refractions.net/">Εξυπηρετητής γεωγραφικών Πληροφοριών (PostGIS)</a></li>
<li><a href="http://openfts.sourceforge.net/">Αναζήτηση Πλήρους Κειμένου (OpenFTS)</a></li>
<li><a href="http://www.bizgres.org">Επιχειρησιακή Λογική/Αποθήκευση Δεδομένων (Bizgres)</a></li>
</ul>

<h3>Γραφικά Περιβάλλοντα Διεπαφής</h3>

<ul>
<li><a href="http://www.pgadmin.org/">pgAdmin III</a></li>
<li><a href="http://phppgadmin.sourceforge.net/">phpPgAdmin</a></li>
<li><a href="http://www.pgaccess.org/">pgAccess</a></li>
<li><a href="http://techdocs.postgresql.org/guides/GUITools">Λίστα άλλων ΓΠΔ</a></li>
</ul>

<h3>Αναπαραγωγή</h3>

<ul>
<li><a href="http://www.slony.info/">Slony-I</a></li>
<li><a href="http://pgfoundry.org/projects/pgpool/">pgPool</a></li>
<li><a href="http://pgfoundry.org/projects/pgcluster/">pgCluster</a></li>
</ul>


