<!-- BEGIN page_title_block -->
Presse-Mappe PostgreSQL 8
<!-- END page_title_block -->

<h1>PostgreSQL 8.0 Pressemappe</h1>
<p>NEW YORK, NEW YORK: 19. JANUAR 2005 - Die PostgreSQL Global Development Group gibt die Version 8.0 des objektrelationalen Datenbankmanagementsystems PostgreSQL frei und best&auml;tigt damit seine technologische F&uuml;hrungsposition unter den Open-Source Datenbanken. Die aktuelle Version bietet Leistungsmerkmale, die bislang nur in den teuersten propriet&auml;ren Datenbanksystemen verf&uuml;gbar waren, und soll f&uuml;r einen deutlich st&auml;rkeren Einsatz von PostgreSQL bei Anwendern und Software-Herstellern sorgen.</p>

<p>Zus&auml;tzlich zu den deutlichen Verbesserungen bei der Skalierbarkeit, den Features und einer erheblichen Leistungssteigerung demonstriert PostgreSQL 8.0 die einmalige Entwicklungsgeschwindigkeit des Open-Source-Ansatzes. Mehr als ein Dutzend Unternehmen, darunter Red Hat, Fujitsu, Afilias, Software Research Associates Inc., 2nd Quadrant und Command Prompt Inc., sowie hunderte freiwillige Entwickler haben dazu beigetragen, dass das Leistungsspektrum der Version 8.0 st&auml;rker erweitert wurde, als in jeder anderen Version zuvor.  </p>

<p>"Wir sind zuversichtlich, dass diese Enterprise-Features eine gro&szlig;e Zahl neuer PostgreSQL-Anwender anziehen werden.", so Takayuki Nakazawa, Direktor der OSS Datenbank-Gruppe von Fujitsu Software. "Fujitsu ist stolz auf seine finanzielle F&ouml;rderung der PostgreSQL-Entwicklung und auf seine Zusammenarbeit mit der PostgreSQL-Community. Wir stehen hinter unseren Anstrengungen, PostgreSQL zum f&uuml;hrenden Datenbankmanagementsystem zu machen." </p>

<p>Einige der neuen Features sind:</p>

<ul>
<li><b>Native Windows-Unterst&uuml;tzung:</b> PostgreSQL steht mit der Version 8 auch als Windows-Installer zur Verf&uuml;gung und ben&ouml;tigt keine Emulationsschicht. Dies f&uuml;hrt zu einer dramatisch verbesserten Performance gegen&uuml;ber vorherigen Versionen und bietet Software-Herstellern, Anwenderunternehmen und freien Windows-Entwicklern eine &uuml;berzeugende Alternative zu propriet&auml;ren Datenbanksystemen. </li>
<li><b>Savepoints:</b> Dieses Feature aus dem SQL-Standard erlaubt, spezifische Teile einer Datenbank-Transaktion r&uuml;ckg&auml;ngig zu machen, ohne die gesamte Operation abzubrechen. Davon profitieren insbesondere Applikationsentwickler, die auf die M&ouml;glichkeit angewiesen sind, in komplexen Transaktionen einzelne Fehler zur&uuml;ckzurollen.</li>
<li><b>Point in Time Recovery:</b> Dieses Feature erlaubt eine vollst&auml;ndige Datenrekonstruktion aus den automatisch und durchgehend archivierten Transaktionsprotokollen. Damit steht f&uuml;r PostgreSQL endlich eine lang erwartete Alternative zur st&uuml;ndlichen oder t&auml;glichen Sicherung in kritischen Anwendungen zur Verf&uuml;gung. </li>
<li><b>Tablespaces:</b> Entscheidend f&uuml;r Administratoren von Data-Warehousing Systemen mit riesigen Datenbest&auml;nden ist, dass mit Tablespaces gro&szlig;e Tabellen und Indizes auf eigenen Datentr&auml;gern oder RAID-Systemen ausgelagert werden k&ouml;nnen, was die Abfragegeschwindigkeit deutlich steigert.</li>
<li><b>Verbesserte Speicherverwaltung und I/O:</b> Die Nutzung von Datentr&auml;gern und des Arbeitsspeichers wurde durch den Adaptive-Replacement-Cache Algorithmus, den neuen Background-Writer und das neue VACUUM-Delay Feature optimiert. Dadurch sind  Belastungen des Systems besser vorhersehbar und die Performance ist in Spitzenzeiten deutlich konstanter.</li>
</ul>
<p>Javier Soltero, Chef-Architekt bei Hyperic LLC, meint hierzu: "PostgreSQL 8.0 gibt uns jenen hohen Grad an Parallelit&auml;t und Durchsatz, den unsere HQ Monitoring-Produkte ben&ouml;tigen. Mit der nativen Windows-Unterst&uuml;tzung von PostgreSQL 8.0 k&ouml;nnen wir PostgreSQL jetzt mit unseren Produkten b&uuml;ndeln und profitieren sowohl von der bew&auml;hrten Skalierbarkeit und Performance von PostgreSQL, als auch von der Lizenz, die es uns gestattet PostgreSQL ohne Lizenzgeb&uuml;hren in unseren Distributionen mitzuliefern."</p>

<p>Neben den vielen Features die in der neuen Version hinzugekommen sind, wurde PostgreSQL im vergangenen Jahr durch die schnellere Entwicklung von Add-ons und optionalen Komponenten erweitert. Das Replikationssystem Slony-I und das Connection-Pooling/Brokering Utility namens pgPool werden bereits in hochverf&uuml;gbaren Server-Pools eingesetzt. Verschiedene Stored-Procedure-Sprachen wurden hinzugef&uuml;gt oder wesentlich erweitert, unter anderem PL/Java, PL/PHP und PL/Perl, w&auml;hrend Npgsql und der PGsqlClient .Net Data-Provider erweitert wurden, um die vielen neuen Windows-Anwender zu unterst&uuml;tzen.</p>

<p>Eine vollst&auml;ndige Liste und Beschreibung der neuen Features in 8.0 ist auf der <a href="http://pgfoundry.org/about/press">Presse-Seite</a> zu finden. </p>

<p><b>&Uuml;ber PostgreSQL:</b> PostgreSQL ist das gemeinsame Werk von hunderten Software-Entwicklern und baut auf eine fast 20-j&auml;hrige Entwicklung, welche an der University of California in Berkeley begann. Aufgrund der langj&auml;hrigen Unterst&uuml;tzung von umfangreichen Leistungsmerkmalen im Enterprise-Bereich, unter anderem Transaktionen, Funktionen, Trigger und Subqueries, wird PostgreSQL heute von vielen der anspruchsvollsten Unternehmen und Beh&ouml;rden eingesetzt. PostgreSQL steht unter der BSD-Lizenz, welche die Nutzung und Distribution ohne Lizenzgeb&uuml;hren erlaubt, sowohl f&uuml;r kommerzielle als auch f&uuml;r nicht-kommerzielle Anwendungen.</p>

<p>Um mehr &uuml;ber PostgreSQL zu erfahren bzw. die Software herunterzuladen, besuchen Sie bitte:<br>In Deutsch: <a href="http://www.postgresql.de/">http://www.postgresql.de/</a><br>
Oder in Englisch: <a href="http://www.postgresql.org/<br>">http://www.postgresql.org/</a></p>

<h2>Zus&auml;tzliche Features in dieser Version</h2>

<p>Neben den oben genannten wichtigsten neuen Features gibt es noch unz&auml;hlige andere neue Eigenschaften und Verbesserungen, die f&uuml;r die bisherigen PostgreSQL-Anwender von gro&szlig;em Interesse sind.</p>
<ul>
<li><b>Funktionen:</b> PostgreSQL-Funktionen unterst&uuml;tzen das sogenannte Dollar-Quoting f&uuml;r unmaskierte Hochkommata und Anf&uuml;hrungszeichen, was dem Anwender hilft, besser lesbaren und wartbaren Code zu schreiben. Weiterhin haben PL/pgSQL-Funktionen (als Vorteil durch die neuen Savepoints) eingeschr&auml;nkte F&auml;higkeiten zum Exception-Handling (<code>EXCEPTION</code>-clause). </li>
<li><b>Datenbank-Design:</b> Datenbank-Administratoren k&ouml;nnen jetzt mit <code>ALTER TABLE</code> die Datentypen von Spalten &auml;ndern. Die Deklaration von Spalten mit zusammengesetzten Datentypen wird ebenfalls seit dieser Version gem&auml;&szlig; dem SQL-Standard unterst&uuml;tzt. Au&szlig;erdem kann mit <code>CHANGE OWNER</code> der Eigent&uuml;mer aller Datenbank-Objekte ver&auml;ndert werden.</li>
<li><b>Daten-Import/-Export:</b> Der <code>COPY</code>-Befehl unterst&uuml;tzt nun das weit verbreitete Comma-Separated-Values (CSV) Datei-Format, was den Import von bzw. den Export in andere Software-L&ouml;sungen erleichtert. </li>
<li><b>Verbesserungen des Abfrage-Optimierers:</b> Abfrageplaner und Ausf&uuml;hrungs-Einheit nutzen nun auch Indizes von kompatiblen Datentypen, daher sind explizite Typ-Umwandlungen von konstanten Werten wesentlich seltener notwendig. Diese Version beinhaltet au&szlig;erdem eine verbesserte Index-Nutzung, st&auml;rkere Optimierung von Oder-Klauseln, verbessertes Sampling f&uuml;r <code>ANALYZE</code>, ein schnelleres <code>TRUNCATE</code> und eine bessere Generierung von vorbereiteten Abfragepl&auml;nen, sowie zahllose kleine Verbesserungen, deren Aufz&auml;hlung hier den Rahmen sprengen w&uuml;rde. </li>
<li><b>Logging:</b> Administratoren k&ouml;nnen ab sofort auch eine automatische Rotation des PostgreSQL-Protokolls durch die postgresql.conf Datei aufsetzen. Das Logging von PostgreSQL kann noch individueller konfiguriert werden als bisher. Administratoren k&ouml;nnen unter anderem Zeilen-Pr&auml;fixe definieren, einzelne Typen von SQL-Anweisungen f&uuml;r die Aufzeichnung ausw&auml;hlen, sowie Verbindungsabbr&uuml;che protokollieren.</li>
<li><b>Datensicherung:</b> Weitgehend neu programmiert wurde pg_dump, ein Backup-Utility, mit dem Datenbest&auml;nde auch zwischen verschiedenen PostgreSQL-Installationen ausgetauscht werden k&ouml;nnen. Diese Version erg&auml;nzt einige neue F&auml;higkeiten, wie etwa das Setzen von Start- und Stopp-Zeiten, und entfernt die verbliebenen Portabilit&auml;ts- und Abh&auml;ngigkeitsprobleme in den Backup-Dateien.</li>
</ul>
<p>Selbstverst&auml;ndlich gibt es noch viele weitere &Auml;nderungen und Verbesserungen. Bitte lesen Sie die (englischen) <a href="http://pgfoundry.org/docs/8.0/static/release.htm">Release Notes</a> f&uuml;r eine vollst&auml;ndige Liste.</p>

<h2>Vollst&auml;ndige Zitate aus der Pressemitteilung</h2>

<p>"Fujitsu ist sehr zufrieden mit den neuen Features in PostgreSQL 8.0. Wir sind &uuml;berzeugt, dass diese Enterprise-Features eine gro&szlig;e Zahl an neuen PostgreSQL-Anwendern anziehen werden.", so Takayuki Nakazawa, Direktor der OSS Datenbank-Gruppe von Fujitsu Software. "Fujitsu ist stolz auf seine finanzielle F&ouml;rderung der PostgreSQL-Entwicklung und auf seine Zusammenarbeit mit der PostgreSQL-Community. Wir stehen hinter unseren Anstrengungen, PostgreSQL zum f&uuml;hrenden Datenbankmanagementsystem zu machen." </p>

<p>Javier Soltero, Chef-Architekt bei Hyperic LLC, meint hierzu: "PostgreSQL 8.0 gibt uns jenen hohen Grad an Parallelit&auml;t und Durchsatz, den unsere HQ Monitoring-Produkte ben&ouml;tigen. Unser Team hat plattform-unabh&auml;ngige Java-Datenbanken sowohl aus dem kommerziellen als auch dem Open-Source-Bereich evaluiert, aber wir konnten keine Datenbank finden, die unsere Anforderungen erf&uuml;llt hat. Mit der nativen Windows-Unterst&uuml;tzung von PostgreSQL 8.0 k&ouml;nnen wir PostgreSQL jetzt mit unseren Produkten b&uuml;ndeln und profitieren sowohl von der bew&auml;hrten Skalierbarkeit und Performance von PostgreSQL, als auch von der Lizenz, die uns gestattet PostgreSQL ohne Lizenzgeb&uuml;hren in unseren Distributionen mitzuliefern. Die PostgreSQL-Gruppe hat sich einen guten Ruf f&uuml;r seine Qualit&auml;t verdient, und dessen Berechtigung wurde uns sofort klar, als wir die allererste &ouml;ffentliche 8.0 Betaversion begutachteten."</p>

<h2>Hier erhalten Sie PostgreSQL 8.0:</h2>
<ul>
<li><a href="http://pgfoundry.org/download/mirrors-ftp">Liste mit FTP-Mirrors </a>  </li>
<li><a href="http://pgfoundry.org/download/bittorrent">Bittorrent</a> </li>
<li><a href="http://pgfoundry.org/projects/pginstaller/">Windows-Installer (auch &uuml;ber Bittorrent)</a></li>
<li><a href="http://sourceforge.net/projects/pgsql/">SourceForge (inklusive Windows-Installer)</a></li>
</ul>

<h2>F&uuml;r weitere Informationen kontaktieren Sie bitte: </h2>

	<p>Im deutschsprachigen Raum (Deutschland, Schweiz):<br>
		Anastasios Hatzis<br>
		<a href="mailto:de@postgresql.org">de at postgresql.org</a><br>
		DE +49-30-20005021<br><br>

	Im deutschsprachigen Raum (&Ouml;sterreich):<br>
		Ewald Geschwinde <br>
		<a href="mailto:at@postgresql.org">at at postgresql.org</a><br>
		AT +43-66-44527844 </p>

         <p>Oder in Englisch:<br>
                 Josh Berkus <br>
                 PostgreSQL Project<br>
                 +1-415-752-2500<br>
                 <a href="mailto:josh@postgresql.org">josh at postgresql.org</a></p>

<h2>Verweise zu weiteren Informationen: </h2>

<h3>Dokumentation:</h3>
<ul>
<li><a href="http://pgfoundry.org/docs">Offizielle Dokumentation</a></li>
<li><a href="http://techdocs.postgresql.org/">Technische Dokumentation</a></li>
<li><a href="http://www.varlena.com/GeneralBits">General Bits</a></li>
</ul>

<h3>Treiber:</h3>
<ul>
<li><a href="http://jdbc.postgresql.org/">JDBC</a></li>
<li><a href="http://gborg.postgresql.org/project/psqlodbc/projdisplay.php">ODBC</a></li>
<li><a href="http://gborg.postgresql.org/project/npgsql/projdisplay.php">.Net</a></li>
</ul>

<h3>Grafische Bedienungsoberfl&auml;chen (GUIs):</h3>
<ul>
<li><a href="http://www.pgadmin.org/">pgAdminIII</a></li>
<li><a href="http://phppgadmin.sourceforge.net/">phpPgAdmin</a> </li>
<li><a href="http://www.pgaccess.org/">pgAccess</a>  </li>
<li><a href="http://techdocs.postgresql.org/guides/GUITools">Liste mit weiteren GUIs</a></li>
</ul>

<h3>Replikation:</h3>
<ul>
<li><a href="http://www.slony.info/">Slony-I</a> </li>
<li><a href="http://pgfoundry.org/projects/pgpool/">pgReplicator</a></li>
<li><a href="http://www.erserver.com/">eRServer</a></li>
</ul>
<h3>Verwandte Projekte:</h3>
<ul>
<li><a href="http://projects.postgresql.org/">pgFoundry</a></li>
<li><a href="http://gborg.postgresql.org/">GBorg</a></li>
</ul>
<h2>Informationen &uuml;ber die zitierten Unternehmen</h2>

<p><b>&Uuml;ber Fujitsu:</b> Fujitsu geh&ouml;rt zu den f&uuml;hrenden Anbietern von kundenorientierten IT- und Kommunikationsl&ouml;sungen f&uuml;r den internationalen Markt. Dank der fortschrittlichen Technologien, der besten Plattformen f&uuml;r Computersysteme und Telekommunikationsl&ouml;sungen und seiner weltweit agierenden Teams von System- und Servicespezialisten ist Fujitsu in der einzigartigen Lage, die unendlichen M&ouml;glichkeiten, die das Internet bietet, freizusetzen und somit seinen Kunden zum Erfolg zu verhelfen. Mit Hauptsitz in Tokyo meldete Fujitsu Limited (TSE: 6702) einen konsolidierten Umsatz in H&ouml;he von 4,7 Billionen Yen (37 Mrd. Euro) f&uuml;r das Gesch&auml;ftsjahr, das am 31. M&auml;rz 2004 endete.
Allgemeine Informationen &uuml;ber Fujitsu sind verf&uuml;gbar unter: <a href="http://www.fujitsu.com">http://www.fujitsu.com</a>. Details &uuml;ber die Fujitsu Supported PostgreSQL (FSP) Initiative, einschlie&szlig;lich White-Paper-Dokumente, sind verf&uuml;gbar unter: <a href="http://fastware.com.au/postgresql.html">http://fastware.com.au/postgresql.html</a>. Bitte richten Sie Anfragen an Liam O'Duibhir, Fujitsu Australia Software Technology <a href="mailto:liamod@fast.fujitsu.com.au">liamod at fast.fujitsu.com.au</a>, Tel.: +61-2-9452 9068 (nur Englisch).</p>

<p><b>&Uuml;ber Hyperic:</b> Der Technologie-Anbieter Hyperic, LLC ist spezialisiert auf L&ouml;sungen f&uuml;r das Management von Open-Source- und kommerzieller IT-Infrastruktur. Flaggschiff unter seinen Produkten ist HQ, welches als Alternative zu kostspieligen, veralteten Management-Frameworks positioniert ist. HQ liefert eine offene, skalierbare und web-basierte Plattform, die alle heutzutage in der IT eingesetzten Technologien unterst&uuml;tzt. F&uuml;r weitere Informationen kontaktieren Sie bitte <a href="mailto:press@hyperic.net">press at hyperic.net</a> (Englisch und Spanisch).</p></body></html>
























Deutschland
Anastasios Hatzis
de@postgresql.org
Phone: +49-30-20005021
Cell: +49-173-5625858
http://www.postgresql.de/

&Ouml;sterreich
Ewald Geschwinde
at@postgresql.org
Cell: +43-664-4527844

Weitere Informationen &uuml;ber Fujitsu und Hyperic LLC entnehmen Sie bitte unserer Presseseite.
</p>
